; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-4-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p0-10 - location
	p1-6 - location
	p2-4 - location
	p2-7 - location
	p3-6 - location
	p4-0 - location
	p5-11 - location
	p7-9 - location
	p7-10 - location
	p8-0 - location
	p8-6 - location
	p9-5 - location
	p9-7 - location
	p9-10 - location
	p10-1 - location
	p10-3 - location
	p10-5 - location
	p10-8 - location
	p11-1 - location
	p11-10 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s11)
	(at driver3 s9)
	(at driver4 s9)
	(at driver5 s5)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s6)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s5)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s2)
	(at package2 s10)
	(at package3 s3)
	(at package4 s7)
	(at package5 s1)
	(at package6 s11)
	(at package7 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-10)
	(path p0-10 s0)
	(path s10 p0-10)
	(path p0-10 s10)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s5 p5-11)
	(path p5-11 s5)
	(path s11 p5-11)
	(path p5-11 s11)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s9 p9-10)
	(path p9-10 s9)
	(path s10 p9-10)
	(path p9-10 s10)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(path s10 p10-3)
	(path p10-3 s10)
	(path s3 p10-3)
	(path p10-3 s3)
	(path s10 p10-5)
	(path p10-5 s10)
	(path s5 p10-5)
	(path p10-5 s5)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-10)
	(path p11-10 s11)
	(path s10 p11-10)
	(path p11-10 s10)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 78)
	(= (time-to-drive s2 s0) 78)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 65)
	(= (time-to-drive s7 s0) 65)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 94)
	(= (time-to-drive s9 s0) 94)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 84)
	(= (time-to-drive s0 s1) 84)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 45)
	(= (time-to-drive s7 s1) 45)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 84)
	(= (time-to-drive s9 s1) 84)
	(link s1 s11)
	(link s11 s1)
	(= (time-to-drive s1 s11) 4)
	(= (time-to-drive s11 s1) 4)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 87)
	(= (time-to-drive s6 s2) 87)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 37)
	(= (time-to-drive s10 s2) 37)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 22)
	(= (time-to-drive s0 s3) 22)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 97)
	(= (time-to-drive s7 s3) 97)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 5)
	(= (time-to-drive s10 s3) 5)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 18)
	(= (time-to-drive s3 s4) 18)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 33)
	(= (time-to-drive s5 s4) 33)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 73)
	(= (time-to-drive s11 s5) 73)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 37)
	(= (time-to-drive s0 s6) 37)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 78)
	(= (time-to-drive s1 s6) 78)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 48)
	(= (time-to-drive s5 s6) 48)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 82)
	(= (time-to-drive s8 s6) 82)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 56)
	(= (time-to-drive s2 s7) 56)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 26)
	(= (time-to-drive s4 s7) 26)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 83)
	(= (time-to-drive s8 s7) 83)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 77)
	(= (time-to-drive s9 s7) 77)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 11)
	(= (time-to-drive s5 s8) 11)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 92)
	(= (time-to-drive s3 s9) 92)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 38)
	(= (time-to-drive s8 s9) 38)
	(link s9 s11)
	(link s11 s9)
	(= (time-to-drive s9 s11) 6)
	(= (time-to-drive s11 s9) 6)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 52)
	(= (time-to-drive s4 s10) 52)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 29)
	(= (time-to-drive s6 s10) 29)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 47)
	(= (time-to-drive s8 s10) 47)
	(link s11 s6)
	(link s6 s11)
	(= (time-to-drive s11 s6) 83)
	(= (time-to-drive s6 s11) 83)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 6)
	(= (time-to-drive s7 s11) 6)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 11)
	(= (time-to-drive s10 s11) 11)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s9)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s7)
	(at truck1 s2)
	(at truck3 s11)
	(at truck4 s10)
	(at package1 s7)
	(at package2 s2)
	(at package3 s1)
	(at package4 s11)
	(at package5 s9)
	(at package6 s2)
	(at package7 s3)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver5 truck4 s5)
   deleted: (at driver5 s5) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 0 of 14
2. (drive-truck truck4 s5 s11 driver5)
   deleted: (at truck4 s5)
   added: (at truck4 s11)
   changed: (fuel-used) from 0 to 730
   goals met: 0 of 14
3. (walk driver1 s7 p7-9)
   deleted: (at driver1 s7)
   added: (at driver1 p7-9)
   goals met: 0 of 14
4. (walk driver1 p7-9 s9)
   deleted: (at driver1 p7-9)
   added: (at driver1 s9)
   goals met: 1 of 14
5. (walk driver4 s9 p7-9)
   deleted: (at driver4 s9)
   added: (at driver4 p7-9)
   goals met: 1 of 14
6. (load-truck package6 truck4 s11)
   deleted: (at package6 s11)
   added: (in package6 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 1 of 14
7. (walk driver4 p7-9 s7)
   deleted: (at driver4 p7-9)
   added: (at driver4 s7)
   goals met: 2 of 14
8. (drive-truck truck4 s11 s1 driver5)
   deleted: (at truck4 s11)
   added: (at truck4 s1)
   changed: (fuel-used) from 730 to 774
   goals met: 2 of 14
9. (load-truck package5 truck4 s1)
   deleted: (at package5 s1)
   added: (in package5 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 2 of 14
10. (drive-truck truck4 s1 s0 driver5)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (fuel-used) from 774 to 1866
   goals met: 2 of 14
11. (load-truck package7 truck4 s0)
   deleted: (at package7 s0)
   added: (in package7 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 2 of 14
12. (walk driver2 s11 p11-10)
   deleted: (at driver2 s11)
   added: (at driver2 p11-10)
   goals met: 2 of 14
13. (walk driver2 p11-10 s10)
   deleted: (at driver2 p11-10)
   added: (at driver2 s10)
   goals met: 2 of 14
14. (walk driver2 s10 p0-10)
   deleted: (at driver2 s10)
   added: (at driver2 p0-10)
   goals met: 2 of 14
15. (drive-truck truck4 s0 s2 driver5)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (fuel-used) from 1866 to 3114
   goals met: 2 of 14
16. (walk driver3 s9 p9-10)
   deleted: (at driver3 s9)
   added: (at driver3 p9-10)
   goals met: 2 of 14
17. (walk driver3 p9-10 s10)
   deleted: (at driver3 p9-10)
   added: (at driver3 s10)
   goals met: 2 of 14
18. (walk driver2 p0-10 s0)
   deleted: (at driver2 p0-10)
   added: (at driver2 s0)
   goals met: 3 of 14
19. (unload-truck package6 truck4 s2)
   deleted: (in package6 truck4)
   added: (at package6 s2)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 4 of 14
20. (load-truck package1 truck4 s2)
   deleted: (at package1 s2)
   added: (in package1 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 4 of 14
21. (drive-truck truck4 s2 s10 driver5)
   deleted: (at truck4 s2)
   added: (at truck4 s10)
   changed: (fuel-used) from 3114 to 3706
   goals met: 5 of 14
22. (load-truck package2 truck4 s10)
   deleted: (at package2 s10)
   added: (in package2 truck4)
   changed: (load truck4) from 3 to 4, (fuel-per-minute truck4) from 16 to 20
   goals met: 5 of 14
23. (drive-truck truck4 s10 s11 driver5)
   deleted: (at truck4 s10)
   added: (at truck4 s11)
   changed: (fuel-used) from 3706 to 3926
   goals met: 4 of 14
24. (drive-truck truck4 s11 s9 driver5)
   deleted: (at truck4 s11)
   added: (at truck4 s9)
   changed: (fuel-used) from 3926 to 4046
   goals met: 4 of 14
25. (walk driver3 s10 p0-10)
   deleted: (at driver3 s10)
   added: (at driver3 p0-10)
   goals met: 4 of 14
26. (walk driver3 p0-10 s0)
   deleted: (at driver3 p0-10)
   added: (at driver3 s0)
   goals met: 5 of 14
27. (unload-truck package5 truck4 s9)
   deleted: (in package5 truck4)
   added: (at package5 s9)
   changed: (load truck4) from 4 to 3, (fuel-per-minute truck4) from 20 to 16
   goals met: 6 of 14
28. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 14
29. (drive-truck truck4 s9 s7 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s7)
   changed: (fuel-used) from 4046 to 5278
   goals met: 5 of 14
30. (unload-truck package1 truck4 s7)
   deleted: (in package1 truck4)
   added: (at package1 s7)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 6 of 14
31. (load-truck package4 truck4 s7)
   deleted: (at package4 s7)
   added: (in package4 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 6 of 14
32. (drive-truck truck4 s7 s2 driver5)
   deleted: (at truck4 s7)
   added: (at truck4 s2)
   changed: (fuel-used) from 5278 to 6174
   goals met: 6 of 14
33. (unload-truck package2 truck4 s2)
   deleted: (in package2 truck4)
   added: (at package2 s2)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 7 of 14
34. (drive-truck truck4 s2 s10 driver5)
   deleted: (at truck4 s2)
   added: (at truck4 s10)
   changed: (fuel-used) from 6174 to 6655
   goals met: 8 of 14
35. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 6655 to 7435
   goals met: 9 of 14
36. (drive-truck truck4 s10 s3 driver5)
   deleted: (at truck4 s10)
   added: (at truck4 s3)
   changed: (fuel-used) from 7435 to 7500
   goals met: 8 of 14
37. (unload-truck package7 truck4 s3)
   deleted: (in package7 truck4)
   added: (at package7 s3)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 9 of 14
38. (load-truck package3 truck4 s3)
   deleted: (at package3 s3)
   added: (in package3 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 9 of 14
39. (drive-truck truck4 s3 s10 driver5)
   deleted: (at truck4 s3)
   added: (at truck4 s10)
   changed: (fuel-used) from 7500 to 7565
   goals met: 10 of 14
40. (drive-truck truck4 s10 s11 driver5)
   deleted: (at truck4 s10)
   added: (at truck4 s11)
   changed: (fuel-used) from 7565 to 7708
   goals met: 9 of 14
41. (unload-truck package4 truck4 s11)
   deleted: (in package4 truck4)
   added: (at package4 s11)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 10 of 14
42. (drive-truck truck4 s11 s1 driver5)
   deleted: (at truck4 s11)
   added: (at truck4 s1)
   changed: (fuel-used) from 7708 to 7752
   goals met: 10 of 14
43. (unload-truck package3 truck4 s1)
   deleted: (in package3 truck4)
   added: (at package3 s1)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 11 of 14
44. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 7752 to 8532
   goals met: 10 of 14
45. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 11 of 14
46. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 14
47. (drive-truck truck1 s0 s6 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (fuel-used) from 8532 to 8902
   goals met: 10 of 14
48. (disembark-truck driver2 truck1 s6)
   deleted: (driving driver2 truck1)
   added: (at driver2 s6) (empty truck1)
   goals met: 10 of 14
49. (board-truck driver2 truck3 s6)
   deleted: (at driver2 s6) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 10 of 14
50. (drive-truck truck4 s1 s6 driver5)
   deleted: (at truck4 s1)
   added: (at truck4 s6)
   changed: (fuel-used) from 8902 to 9682
   goals met: 10 of 14
51. (disembark-truck driver5 truck4 s6)
   deleted: (driving driver5 truck4)
   added: (at driver5 s6) (empty truck4)
   goals met: 10 of 14
52. (board-truck driver5 truck1 s6)
   deleted: (at driver5 s6) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 10 of 14
53. (drive-truck truck1 s6 s2 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (fuel-used) from 9682 to 10552
   goals met: 11 of 14
54. (disembark-truck driver2 truck3 s6)
   deleted: (driving driver2 truck3)
   added: (at driver2 s6) (empty truck3)
   goals met: 11 of 14
55. (disembark-truck driver5 truck1 s2)
   deleted: (driving driver5 truck1)
   added: (at driver5 s2) (empty truck1)
   goals met: 11 of 14
56. (board-truck driver2 truck4 s6)
   deleted: (at driver2 s6) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 11 of 14
57. (drive-truck truck4 s6 s0 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s0)
   changed: (fuel-used) from 10552 to 10922
   goals met: 11 of 14
58. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 12 of 14
59. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 11 of 14
60. (drive-truck truck4 s0 s3 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 10922 to 11142
   goals met: 11 of 14
61. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 11 of 14
62. (walk driver3 s3 p3-6)
   deleted: (at driver3 s3)
   added: (at driver3 p3-6)
   goals met: 11 of 14
63. (walk driver3 p3-6 s6)
   deleted: (at driver3 p3-6)
   added: (at driver3 s6)
   goals met: 11 of 14
64. (board-truck driver3 truck3 s6)
   deleted: (at driver3 s6) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 11 of 14
65. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   goals met: 10 of 14
66. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 10 of 14
67. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 14
68. (drive-truck truck3 s6 s11 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s11)
   changed: (fuel-used) from 11142 to 11972
   goals met: 11 of 14
69. (drive-truck truck4 s3 s0 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 11972 to 12192
   goals met: 11 of 14
70. (drive-truck truck4 s0 s6 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s6)
   changed: (fuel-used) from 12192 to 12562
   goals met: 11 of 14
71. (disembark-truck driver3 truck3 s11)
   deleted: (driving driver3 truck3)
   added: (at driver3 s11) (empty truck3)
   goals met: 11 of 14
72. (drive-truck truck4 s6 s10 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s10)
   changed: (fuel-used) from 12562 to 12852
   goals met: 12 of 14
73. (drive-truck truck4 s10 s3 driver2)
   deleted: (at truck4 s10)
   added: (at truck4 s3)
   changed: (fuel-used) from 12852 to 12902
   goals met: 11 of 14
74. (walk driver3 s11 p11-10)
   deleted: (at driver3 s11)
   added: (at driver3 p11-10)
   goals met: 11 of 14
75. (walk driver3 p11-10 s10)
   deleted: (at driver3 p11-10)
   added: (at driver3 s10)
   goals met: 11 of 14
76. (walk driver3 s10 p0-10)
   deleted: (at driver3 s10)
   added: (at driver3 p0-10)
   goals met: 11 of 14
77. (drive-truck truck4 s3 s10 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s10)
   changed: (fuel-used) from 12902 to 12952
   goals met: 12 of 14
78. (disembark-truck driver2 truck4 s10)
   deleted: (driving driver2 truck4)
   added: (at driver2 s10) (empty truck4)
   goals met: 12 of 14
79. (walk driver3 p0-10 s0)
   deleted: (at driver3 p0-10)
   added: (at driver3 s0)
   goals met: 13 of 14
80. (walk driver2 s10 p0-10)
   deleted: (at driver2 s10)
   added: (at driver2 p0-10)
   goals met: 13 of 14
81. (walk driver2 p0-10 s0)
   deleted: (at driver2 p0-10)
   added: (at driver2 s0)
   goals met: 14 of 14
